{
    "cves": [
        "CVE-2020-10711",
        "CVE-2020-12770"
    ],
    "description": "It was discovered that the network block device (nbd) implementation in the\nLinux kernel did not properly check for error conditions in some\nsituations. An attacker could possibly use this to cause a denial of service\n(system crash). (CVE-2019-16089)\n\nIt was discovered that the btrfs file system implementation in the Linux\nkernel did not properly validate file system metadata in some situations.\nAn attacker could use this to construct a malicious btrfs image that, when\nmounted, could cause a denial of service (system crash). (CVE-2019-19036,\nCVE-2019-19318, CVE-2019-19813, CVE-2019-19816)\n\nIt was discovered that the btrfs implementation in the Linux kernel did not\nproperly detect that a block was marked dirty in some situations. An\nattacker could use this to specially craft a file system image that, when\nunmounted, could cause a denial of service (system crash). (CVE-2019-19377)\n\nIt was discovered that the kernel->user space relay implementation in the\nLinux kernel did not properly check return values in some situations. A\nlocal attacker could possibly use this to cause a denial of service (system\ncrash). (CVE-2019-19462)\n\nMatthew Sheets discovered that the SELinux network label handling\nimplementation in the Linux kernel could be coerced into de-referencing a\nNULL pointer. A remote attacker could use this to cause a denial of service\n(system crash). (CVE-2020-10711)\n\nIt was discovered that the SCSI generic (sg) driver in the Linux kernel did\nnot properly handle certain error conditions correctly. A local privileged\nattacker could use this to cause a denial of service (system crash).\n(CVE-2020-12770)\n\nIt was discovered that the USB Gadget device driver in the Linux kernel did\nnot validate arguments passed from configfs in some situations. A local\nattacker could possibly use this to cause a denial of service (system\ncrash) or possibly expose sensitive information. (CVE-2020-13143)\n\nIt was discovered that the efi subsystem in the Linux kernel did not handle\nmemory allocation failures during early boot in some situations. A local\nattacker could possibly use this to cause a denial of service (system\ncrash). (CVE-2019-12380)\n\nIt was discovered that the btrfs file system in the Linux kernel in some\nerror conditions could report register information to the dmesg buffer. A\nlocal attacker could possibly use this to expose sensitive information.\n(CVE-2019-19039)\n",
    "id": "USN-4414-2",
    "instructions": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
    "is_hidden": false,
    "published": "2020-07-06T21:28:23.982632",
    "references": [],
    "release_packages": {
        "bionic": [
            {
                "description": "Linux kernel for Google Cloud Platform (GCP) systems",
                "is_source": true,
                "name": "linux-gcp-4.15",
                "version": "4.15.0-1078.88"
            },
            {
                "description": "Linux kernel for Google Container Engine (GKE) systems",
                "is_source": true,
                "name": "linux-gke-4.15",
                "version": "4.15.0-1064.67"
            }
        ],
        "trusty": [
            {
                "description": "Linux kernel for Microsoft Azure Cloud systems",
                "is_source": true,
                "name": "linux-azure",
                "version": "4.15.0-1091.101~14.04.1"
            }
        ]
    },
    "summary": "linux, linux-aws, linux-aws-hwe, linux-azure, linux-azure-4.15, linux-gcp, linux-gcp-4.15, linux-gke-4.15, linux-hwe, linux-kvm, linux-oem, linux-oracle, linux-raspi2, linux-snapdragon vulnerabilities",
    "title": "Linux kernel vulnerabilities"
}